start = "سلام👋به کمک این ربات و هوش‌مصنوعی می‌تونید صداتون رو به صدای گوینده‌های حرفه‌ای، شخصیت‌های فیلم‌ها و انیمیشن‌ها و افراد مشهور تبدیل کنید.\n\n✅برای شروع کافیه که یه **ویس یا فایل صوتی** برای من ارسال کنید. \n\n‼️توجه داشته باشید که برای خروجی بهتر لازمه که صدایی که ارسال می‌کنید بدون نویز یا سر و صدای اضافی باشد."
join_channels = (
    "🔻لطفا برای شروع در کانالهای زیر عضو شوید و دوباره روی /start کلیک کنید\n"
)
voice_select = "🎭 لطفا صدای مورد نظر خود را برای تبدیل انتخاب کنید"
pitch_select = "📢🎵 تنظیم زیر و بمی صدا (Pitch)، لطفا با توجه به صدای ورودی و صدای انتخابی از بین گزینه‌های زیر انتخاب کنید :\n\n🔹 اگر صدای ورودی شما مردانه است و میخواهید به صدای زنانه تبدیل شود، گزینه 'تبدیل صدای مردانه به زنانه' را انتخاب کنید.\n\n🔹 اگر صدای ورودی شما زنانه است و میخواهید به صدای مردانه تبدیل شود، گزینه 'تبدیل صدای زنانه به مردانه' را انتخاب کنید.\n\n🔹 برای تنظیمات دقیق‌تر می‌توانید از گزینه‌های صدای زیر و بم با شدت‌های مختلف استفاده کنید."
pitch_btns = [
    ["🗣 تبدیل صدای زنانه به مردانه", "callback", "pitch_-12", 0],
    ["صدای بم×9", "callback", "pitch_-9", 1],
    ["صدای بم×6", "callback", "pitch_-6", 1],
    ["صدای بم×3", "callback", "pitch_-3", 1],
    ["بدون تغییر | پیش‌فرض", "callback", "pitch_0", 2],
    ["صدای زیر×9", "callback", "pitch_9", 3],
    ["صدای زیر×6", "callback", "pitch_6", 3],
    ["صدای زیر×3", "callback", "pitch_3", 3],
    ["🧔‍♀️ تبدیل صدای مردانه به زنانه", "callback", "pitch_12", 4],
]
proccessing = "🔄در حال پردازش درخواست شما ...\nلطفا کمی منتظر باشید"
no_credits = "‼️اعتبار شما برای این درخواست کافی نیست. برای افزایش اعتبار می‌توانید از /buy_credits استفاده کنید یا با /invite از دوستانتان به ربات دعوت کنید و اعتبار هدیه بگیرید."
banner_msg = """
🔥ربات تقلید صدای هوش‌مصنوعی

😍با استفاده از این ربات می‌تونی صدات رو به صدای گوینده‌های حرفه‌ای، شخصیت‌های فیلم‌ها و انیمیشن‌ها و حتی افراد مشهور تبدیل کنی.

🎙بعضی از صداهای موجود : 
🔻 راوی راز بقا
🔻 پاندی کونگ‌ فو کار
🔻 شرک
🔻 فردوسی پور
🔻محسن چاوشی
و کلی صدای جذاب دیگه

✅همین الان می‌تونی از لینک زیر واردش بشی و یه ویس براش بفرستی تا برات تقلیدش کنه:"""

invite_help = (
    "🎁 با ارسال پیام بالا به دوستانتان می‌توانید اعتبار هدیه دریافت کنید.\n\n"
    "🔸 تعداد دعوت‌های موفق شما: **{refs}**\n\n"
    "🔗 لینک دعوت شما:\n{invite_link}\n\n"
    "🔸 اعتبار شما: **{credits} ثانیه**\n\n"
    "✅ به ازای هر دعوت موفق، **۶۰ ثانیه** اعتبار رایگان دریافت می‌کنید."
)

buy_credits = (
    "💰 خرید اعتبار\n\n"
    "🔸 اعتبار فعلی شما: **{credits} ثانیه**\n\n"
    "📱 برای خرید با پشتیبانی در ارتباط باشید:\n@VoiceClonerSupport"
)
invitation_gift = 60
initial_gift = 60
