start = (
    "سلام👋 {username} عزیز خوش اومدید. \n\n"
    "به کمک این ربات و هوش‌مصنوعی می‌تونید صداتون رو به صدای گوینده‌های حرفه‌ای، "
    "شخصیت‌های فیلم‌ها و انیمیشن‌ها و افراد مشهور تبدیل کنید.\n\n"
    "✅برای شروع کافیه که یه **ویس یا فایل صوتی** برای من ارسال کنید. \n\n"
    "‼️توجه داشته باشید که برای خروجی بهتر لازمه که صدایی که ارسال می‌کنید بدون نویز یا سر و صدای اضافی باشد."
)
gift_msg = "🎁 {inital_credits} ثانیه اعتبار هدیه به شما تعلق گرفت. \n\n"
joined_channels_btn = ["✅ عضو شدم", "callback", "joined_channels", 0]
join_channels = (
    "🔻لطفا برای شروع در کانالهای زیر عضو شوید و روی دکمه عضو شدم کلیک کنید\n"
)
voice_select = "🎭 لطفا صدای مورد نظر خود را برای تبدیل انتخاب کنید"
pitch_select = """
🎙 تنظیم زیر و بمی صدا

📌لطفا با توجه به صدای ورودی و صدایی که انتخاب کردید یک گزینه را برای تنظیم زیر و بمی(Pitch) صدا انتخاب کنید.

1️⃣در صورتیکه صدای ورودی، صدای خانم است و صدای انتخابی، صدای مردانه و یا برعکس از گزینه‌های تبدیل صدای زنانه به مردانه و مردانه به زنانه استفاده کنید.

2️⃣در صورتیکه صدای ورودی صدایی بم است و صدای انتخابی صدای زیرتری دارد و یا برعکس، از گزینه‌های صدای زیر یا بم با شدت‌های مختلف استفاده کنید.

🔍 پیشنهاد می‌شود در ابتدا با گزینه *پیش‌فرض* یک صدا تولید کنید و بعد برای شباهت هر چه بیشتر به صدای انتخاب شده، Pitch مناسب را پیدا کنید."""
pitch_btns = [
    ["🗣 تبدیل صدای زنانه به مردانه", "callback", "pitch_-12", 0],
    # ["🔻 بم+9", "callback", "pitch_-9", 1],
    ["🔻 بم+6", "callback", "pitch_-6", 1],
    ["🔻 بم+3", "callback", "pitch_-3", 1],
    ["🔸 بدون تغییر | پیش‌فرض", "callback", "pitch_0", 2],
    # ["🔺 زیر+9", "callback", "pitch_9", 3],
    ["🔺 زیر+6", "callback", "pitch_6", 3],
    ["🔺 زیر+3", "callback", "pitch_3", 3],
    ["🧔‍♀️ تبدیل صدای مردانه به زنانه", "callback", "pitch_12", 4],
]
proccessing_emojie = "⏳"
proccessing = (
    "🔄در حال پردازش درخواست شما ...\n\n"
    "**🔸 اعتبار باقی‌مانده شما: {credits} ثانیه**\n\n"
    # "بازگشت به منوی اصلی : /menu"
)
no_credits = "‼️اعتبار شما برای این درخواست کافی نیست. برای افزایش اعتبار می‌توانید از /buy_credits استفاده کنید یا با /invite از دوستانتان به ربات دعوت کنید و اعتبار هدیه بگیرید."
banner_msg = """
🔥ربات تقلید صدای هوش‌مصنوعی

😍با استفاده از این ربات می‌تونی صدات رو به صدای گوینده‌های حرفه‌ای، شخصیت‌های فیلم‌ها و انیمیشن‌ها و حتی افراد مشهور تبدیل کنی.

🎙بعضی از صداهای موجود : 
🔻 راوی راز بقا
🔻 پاندی کونگ‌ فو کار
🔻 شرک
🔻 فردوسی پور
🔻محسن چاوشی
و کلی صدای جذاب دیگه

✅همین الان می‌تونی از لینک زیر واردش بشی و یه ویس براش بفرستی تا برات تقلیدش کنه:"""

invite_help = (
    "🎁 با ارسال پیام بالا به دوستانتان می‌توانید اعتبار هدیه دریافت کنید.\n\n"
    "🔸 تعداد دعوت‌های موفق شما: **{refs}**\n\n"
    "🔗 لینک دعوت شما:\n{invite_link}\n\n"
    "🔸 اعتبار  باقیمانده شما: **{credits} ثانیه**\n\n"
    "✅ به ازای هر دعوت موفق، **۶۰ ثانیه** اعتبار رایگان دریافت می‌کنید.\n\n"
    # "⬅️ بازگشت به منوی اصلی : /menu"
)

buy_credits_message = (
    "💰 خرید اعتبار\n\n"
    "🔸 اعتبار باقیمانده شما: **{credits} ثانیه**\n\n"
    "📱 برای خرید با پشتیبانی در ارتباط باشید:\n{amdin}\n\n"
    # "⬅️ بازگشت به منوی اصلی : /menu"
)
invitation_gift = 100
initial_gift = 200
credits_message = (
    "🔸 اعتبار باقیمانده شما: **{credits} ثانیه**\n\n"
    "📱 برای خرید با پشتیبانی در ارتباط باشید:\n{amdin}\n\n"
    # "⬅️ بازگشت به منوی اصلی : /menu"
)
categories_lable = {
    "celebritie": "👥 چهره‌های مشهور",
    "singer": "🎤 خوانندگان",
    "voice_actor": "🎙️ گویندگان",
    "character": "🦸 شخصیت‌ها",
    "actor": "🎭 بازیگران",
}
select_category = "🎭 لطفا یکی از صداها را انتخاب کنید"
category_header = "--==🔻{category}  | تعداد صداها: {count} 🔻==--"
menu_msg = "خوش آمدید، لطفا یک گزینه را انتخاب کنید : "
menu_btns = [
    ["💰 اعتبار", "callback", "credits", 0],
    ["🎙️ تقلید صدا", "callback", "convert_voice", 0],   
    ["📖 راهنما", "callback", "help", 1],
    ["🎁 دعوت از دوستان", "callback", "invite", 1],

]
help_msg = """
🚦 راهنمای استفاده از ربات تقلید صدای Neda AI

🎙 این ربات می‌تونه صدای شما رو به صدای گوینده‌های حرفه‌ای، افراد مشهور، کاراکترهای فیلم و سریال و انیمیشن و خواننده‌های مطرح تبدیل کنه.

📌 از Nedaai می‌تونید برای ساختن محتواهای جذاب، نَرِیشن و گویندگی ویدیوهای تبلیغاتی استفاده کنید و یک ویدیوی درگیرکننده بسازید.

🎤 برای استفاده از این ربات کافیه که یک ویس یا فایل صوتی براش بفرستید و از بین گزینه صداهای موجود یکی رو انتخاب کنید.

👈در ادامه ربات ازتون در خصوص تنظیمات زیری و بمی صدای نهایی می‌پرسه که باید با توجه به صدای ورودی و صدای انتخابی، تنظیمات درست رو برای صداتون پیدا کنید.

- مثلا اگه صدایی که فرستادید به نسبت بم‌تر از صداییه که برای تبدیل شدن انتخاب کردید باید از گزینه‌های زیرتر کردن صدا استفاده کنید.

- یا مثلا اگه صدایی که فرستادید مردانه است و صدایی که انتخاب کردید، صدای یک خانم؛ لازمه از گزینه «تبدیل صدای مرد به زن» استفاده کنید.

- در ادامه ربات براتون ویس ساخته شده با صدای جدید رو می‌فرسته و می‌تونید ذخیره‌اش کنید و تو جاهای مختلف استفاده کنید.

❓ اگه سوالی داشتید می‌تونید از {admin_username} بپرسید

"""
convert_msg = """
✅برای شروع کافیه که یه ویس یا فایل صوتی برای من ارسال کنید. 

‼️توجه داشته باشید که برای خروجی بهتر لازمه که صدایی که ارسال می‌کنید بدون نویز یا سر و صدای اضافی باشد.

"""
admin_id = 791927771
admin_username = "@nedaaisupport"
return_to_menu_button = ["بازگشت به منوی اصلی", "callback", "menu", 0]
error_message = (
    "❌ دستور وارد شده معتبر نیست، برای ورود به منوی اصلی روی /menu کلیک کنید\n\n"
    "🎤 برای تقلید صدا، لطفا یک ویس یا فایل صوتی ارسال کنید"
)
t40_price = 0.000225 #per second
invite_successfully = ( 
    "✨ کاربر {user} با موفقیت دعوت شد.\n\n"
    "🎁 {gift_credits} ثانیه اعتبار به شما تعلق گرفت.\n\n" 
    "📱 برای خرید اعتبار بیشتر با پشتیبانی در ارتباط باشید:\n👨‍💻 {admin}\n\n"
)